{
    "en": {
        "tech": [
            "C (C11)",
            "SQLite3",
            "CLI / TUI",
            "Data Extraction"
        ],
        "features": [
            "Advanced Inventory Management (CRUD)",
            "Batch data loading via CSV files",
            "Automated billing with tax calculation",
            "Real-time stock control and reporting",
            "Colorized TUI for better user experience"
        ],
        "stack": {
            "language": "C",
            "framework": "Native Console Application",
            "tools": [
                "GCC",
                "SQLite CLI",
                "Make"
            ],
            "database": "SQLite3 (Embedded)"
        },
        "screenshots": [],
        "description": "A high-performance Point of Sale (POS) system engineered for high-volume terminal environments. Written in standard C11, it utilizes an embedded SQLite3 engine for industrial-grade data persistence and relational query optimization. The system supports massive batch data imports through CSV parsing and providing instant financial reporting. Its colorized TUI provides high visibility for cashiers, combining the raw speed of a terminal application with the reliability of a professional SQL-backed management tool."
    },
    "es": {
        "tech": [
            "C (C11)",
            "SQLite3",
            "CLI / TUI",
            "Extracción de Datos"
        ],
        "features": [
            "Gestión avanzada de inventarios (CRUD)",
            "Carga masiva de datos mediante archivos CSV",
            "Facturación automatizada con cálculo de impuestos",
            "Control de stock e informes en tiempo real",
            "Interfaz TUI con colores para mejor experiencia de usuario"
        ],
        "stack": {
            "language": "C",
            "framework": "Aplicación de Consola Nativa",
            "tools": [
                "GCC",
                "SQLite CLI",
                "Make"
            ],
            "database": "SQLite3 (Embebida)"
        },
        "screenshots": [],
        "description": "Un sistema de Punto de Venta (POS) de alto rendimiento diseñado para entornos de terminal con gran volumen de transacciones. Escrito en C11 estándar, utiliza un motor SQLite3 embebido para una persistencia de datos de grado industrial y consultas relacionales optimizadas. El sistema soporta importaciones masivas de datos mediante archivos CSV e informes financieros instantáneos. Su interfaz TUI con colores garantiza alta visibilidad, combinando la velocidad pura con la fiabilidad de SQL."
    }
}